input_openfoam/tutorials/multiphase/compressibleInterDyMFoam/laminar/sphereDrop/0.orig/T.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    innerAMI
    {
        type            cyclicAMI;
        value           uniform 300;
    }
    outerAMI
    {
        type            cyclicAMI;
        value           uniform 300;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
    bottom
    {
        type            zeroGradient;
    }
    farFieldWall
    {
        type            zeroGradient;
    }
    sphere
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
